package homework_14;

public class StepsGit {
      /*
- Создать локальный репозиторий git, который будет отслеживать состоянии вашего проекта (там где вы пишете код уроков и домашние задания)
- Создать удаленный репозиторий на GitHub
- Синхронизировать локальный и удаленный репозиторий

- Прислать мне ссылку на репозиторий с проектом

- P.S. Если по какой-то причине вы пишете домашние работы и код на лекциях в двух разных проектах -
создать два репозитория и прислать 2 ссылки

1. git init
2. Если нужно, правим файл .gitignore
3. git add . (или список файлов)
4. Сделать commit (сохранить состояние проекта)
5. Создать удаленный репозиторий (на сайте gitHub)
6. Скопировали ссылку на удаленный репозиторий:
7. git remote add origin https://github.com/.. ССЫЛКА на РЕП.git
8. git push origin main/master


=== Вариант 2
1. В настройках идеа (Settings - Version Control - Git Hub ) должен быть подключен профиль git Hub
2. Заходим в меню git / VCS - GitHub - Share project on GitHub
3. Снимаем галочку private
4. Изменяем название удаленного репозитория (если нужно)
5. Жмет к
     */
}
