package homework_08;
/*Программа, имитирующая систему управления освещением в доме
У светильника в каждой комнате есть 4 режима работы:
выключенный - тусклый - средний - запоминающийся.
У пользователя есть пульт управления светом
У нее есть пульт с несколькими кнопками управления для изменения освещения в доме.
Пользователь выбирает номер кнопки (в вашей программе вы последовательно выбираете число от пользователя).
Каждая кнопка отключает освещение в разных комнатах.
Режим 1 устанавливает: Гостиная и кухня - яркий свет, спальня - тусклый.
2: Гостиная – тусклый, кухня и спальня – незабываемые.
3: Везде средний свет.
4. Выключить свет на кухне
5. Увеличить включение света в 1 гостиной и на кухне.
6: Уменьшить включенный свет на 2 в спальне.
После выбора пользовательского режима - выведите на консоль текущее состояние освещения в доме.
PS Учесть, что, например, если текущее состояние было "средний",
то при его увеличении на +2 состояния сохраняется максимальное яркость.
Т.е. "Яркий" Аналогично с уменьшением направления.

 */
public class Task6 {
}
